https://medium.com/swlh/how-to-rename-columns-in-pandas-in-4-minutes-3a5a2c65010c

In [4]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'Items': 'Car Saxophone Curler Car Slingshot Duff'.split(),
 'Customer': 'Homer Lisa Marge Lisa Bart Homer'.split(),
 'ffwt w rwr': np.arange(6), 'testxxxx': np.arange(6) * 2})

print(df)

       Items Customer  ffwt w rwr  testxxxx
0        Car    Homer           0         0
1  Saxophone     Lisa           1         2
2     Curler    Marge           2         4
3        Car     Lisa           3         6
4  Slingshot     Bart           4         8
5       Duff    Homer           5        10

In [6]:
df.rename(columns={'ffwt w rwr':'Amount','testxxxx':'Costs'}, inplace=True)
print(df)

       Items Customer  Amount  Costs
0        Car    Homer       0      0
1  Saxophone     Lisa       1      2
2     Curler    Marge       2      4
3        Car     Lisa       3      6
4  Slingshot     Bart       4      8
5       Duff    Homer       5     10

In [7]:
 df.columns = [1,2,3,4]
print(df)

           1      2  3   4
0        Car  Homer  0   0
1  Saxophone   Lisa  1   2
2     Curler  Marge  2   4
3        Car   Lisa  3   6
4  Slingshot   Bart  4   8
5       Duff  Homer  5  10

In [8]:
df.columns

Index([1, 2, 3, 4], dtype='int64')

In [10]:
df.columns=['Items','Customer','Amount','Costs']
temp_cols = df.columns       
prefix = 'Simpsons_'  
[prefix + x for x in temp_cols]

['Simpsons_Items', 'Simpsons_Customer', 'Simpsons_Amount', 'Simpsons_Costs']

In [12]:
final_cols = [prefix + x for x in temp_cols]
df.columns=final_cols
df

  Simpsons_Items Simpsons_Customer  Simpsons_Amount  Simpsons_Costs
0            Car             Homer                0               0
1      Saxophone              Lisa                1               2
2         Curler             Marge                2               4
3            Car              Lisa                3               6
4      Slingshot              Bart                4               8
5           Duff             Homer                5              10

In [13]:
final_cols_2 = [prefix + x if x != 'Costs' in temp_cols else x for x in temp_cols]
     
df.columns = final_cols_2
     
df

  Simpsons_Items Simpsons_Customer  Simpsons_Amount  Costs
0            Car             Homer                0      0
1      Saxophone              Lisa                1      2
2         Curler             Marge                2      4
3            Car              Lisa                3      6
4      Slingshot              Bart                4      8
5           Duff             Homer                5     10